#Start сообщение
start_message = '''👋 <b>Добро пожаловать в наш магазин</b> 👋
С помощью этого бота вы сможете приобрести подписку на Playstation
    
❓ <b>Как это работает</b> ❓
    
📍 <em>Вы выбираете какую подписку и на какой срок хотите получить
📍 Бот выставляет вам счет на оплату
📍 После оплаты вы получаете подробную инструкцию по активации подписки</em>
    
❌ <b>Если возникнут сложности</b> ❌
У нас есть активная и отзывчивая поддержка, которая поможет с решением любого вопроса! '''


#Сообщение при выборе Delux
answer_delux = '''Вы выбрали подписку: 
        
⚫ <b>PS PLUS - DELUXE</b> ⚫

❓ <em>Что входит в подписку</em> ❓
<em> 🔹 Доступ к онлайн-игре
 🔹 Скидки в PS Store
 🔹 Классические игры с PS1-PS3
 🔹 Пробные версии новинок
 🔹 Более 700 игр в каталоге</em>
 
Выберите срок подписки'''


#Сообщение при выборе Extra
answer_extra = '''Вы выбрали подписку: 
        
🟡 <b>PS PLUS - EXTRA</b> 🟡

❓ <em>Что входит в подписку</em> ❓ 
🔹 Доступ к онлайн-игре
🔹 Скидки в PS Store
🔹 Каталог из 400+ игр для PS4/PS5
 
Выберите срок подписки'''


#Сообщение при выборе Essenatial
answer_essen = '''Вы выбрали подписку: 
        
⚪ <b>PS PLUS - ESSENTIAL</b> ⚪

❓ <em>Что входит в подписку</em> ❓
🔹 Доступ к онлайн-игре
🔹 Скидки в PS Store
🔹 3 бесплатные игры каждый месяц
 
Выберите срок подписки'''


#Сообщение при выборе EA Play
answer_eplay = '''Вы выбрали подписку: 
        
🔹 <b>Playstation - EA PLAY</b> 🔹

❓ <em>Что входит в подписку</em> ❓
 🔹 Хз
 
Выберите срок подписки'''


#Сообщение при выборе 1 Месяц Delux
time_delux_1_month = '''💎 Вы выбрали подписку: ⚫ <em>PS PLUS - DELUXE</em>
        
⌛ Срок: 1 месяц

💰 Стоимость: Х рублей'''


#Сообщение при выборе 3 Месяцев Delux
time_delux_3_month = '''💎 Вы выбрали подписку: ⚫ <em>PS PLUS - DELUXE</em>
        
⌛ Срок: 3 месяца

💰 Стоимость: Х рублей'''


#Сообщение при выборе 12 Месяцев Delux
time_delux_12_month = '''💎 Вы выбрали подписку: ⚫ <em>PS PLUS - DELUXE</em>
        
⌛ Срок: 12 месяцев

💰 Стоимость: Х рублей'''


#Сообщение при выборе 1 Месяц Extra
time_extra_1_month = '''💎 Вы выбрали подписку: 🟡 <em>PS PLUS - EXTRA</em>
        
⌛ Срок: 1 месяц

💰 Стоимость: Х рублей'''


#Сообщение при выборе 3 Месяцев Extra
time_extra_3_month = '''💎 Вы выбрали подписку: 🟡 <em>PS PLUS - EXTRA</em>
        
⌛ Срок: 3 месяца

💰 Стоимость: Х рублей'''


#Сообщение при выборе 12 Месяцев Extra
time_extra_12_month = '''💎 Вы выбрали подписку: 🟡 <em>PS PLUS - EXTRA</em>
        
⌛ Срок: 12 месяцев

💰 Стоимость: Х рублей'''


#Сообщение при выборе 1 Месяц Essential
time_essen_1_month = '''💎 Вы выбрали подписку: ⚪ <em>PS PLUS - ESSEANTIAL</em>
        
⌛ Срок: 1 месяц

💰 Стоимость: Х рублей'''


#Сообщение при выборе 3 Месяцев Essential
time_essen_3_month = '''💎 Вы выбрали подписку: ⚪ <em>PS PLUS - ESSEANTIAL</em>
        
⌛ Срок: 3 месяца

💰 Стоимость: Х рублей'''


#Сообщение при выборе 12 Месяцев Essential
time_essen_12_month = '''💎 Вы выбрали подписку: ⚪ <em>PS PLUS - ESSEANTIAL</em>
        
⌛ Срок: 12 месяцев

💰 Стоимость: Х рублей'''


#Сообщение при выборе 1 Месяц EA Play
time_eplay_1_month = '''💎 Вы выбрали подписку: 🔹 <em>Playstation - EA PLAY</em>
        
⌛ Срок: 1 месяц

💰 Стоимость: Х рублей'''


#Сообщение при выборе 12 Месяцев Essential
time_eplay_12_month = '''💎 Вы выбрали подписку: 🔹 <em>Playstation - EA PLAY</em>
        
⌛ Срок: 12 месяцев

💰 Стоимость: Х рублей'''


#---ССЫЛКИ---


start_img = ""

delux_img = ""

extra_img = ""

essen_img = ""

eplay_img = ""